{
    "version": "https://jsonfeed.org/version/1",
    "title": "Blog",
    "description": "",
    "home_page_url": "https://GRaynaud.github.io/gh-pages",
    "feed_url": "https://GRaynaud.github.io/gh-pages/feed.json",
    "user_comment": "",
    "author": {
        "name": "G. Raynaud"
    },
    "items": [
        {
            "id": "https://GRaynaud.github.io/gh-pages/le-printemps-du-jeune-age/",
            "url": "https://GRaynaud.github.io/gh-pages/le-printemps-du-jeune-age/",
            "title": "Le printemps du jeune âge",
            "summary": " Le vent dans les cheveux je valse entre les gens. Une famille entière est assise en tailleur Et il flotte dans l’air un parfum d’un ailleurs Où la foule fournit des bienfaits diligents. Plus loin on rit, on danse et l’on boit goulûment. Les&hellip;",
            "content_html": "<p> </p>\n<p>Le vent dans les cheveux je valse entre les gens. <br>Une famille entière est assise en tailleur<br>Et il flotte dans l’air un parfum d’un ailleurs<br>Où la foule fournit des bienfaits diligents.</p>\n<p>Plus loin on rit, on danse et l’on boit goulûment.<br>Les ribambelles font de charmants bavardages<br>Qui raillent sagement de l’âge d’un adage<br>Dont on joue pour ravir comme d’un instrument.</p>\n<p>J’aime voir en passant cette jeunesse éclore<br>Et refaire le monde en jasant de mots doux,<br>Se moquer du vieux temps et sauter dans l’eau d’où<br>Une fontaine siffle un froufrou incolore.</p>\n<p>G.R., Montréal, Juillet-Août 2020</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)"
            ],
            "date_published": "2020-08-19T21:25:02-04:00",
            "date_modified": "2020-08-19T21:25:02-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/making-references-easier-in-latex/",
            "url": "https://GRaynaud.github.io/gh-pages/making-references-easier-in-latex/",
            "title": "Making references easier in Latex",
            "summary": "Scientific knowledge is built \"on the shoulders of giants\", to paraphrase de Chartres. Hence the need for appropriate referencing of the work of researchers around the world. To meet this need, the scientific community has adopted citation standards and tools to identify publications. Among these,&hellip;",
            "content_html": "<p>Scientific knowledge is built \"on the shoulders of giants\", to paraphrase de Chartres. Hence the need for appropriate referencing of the work of researchers around the world. To meet this need, the scientific community has adopted citation standards and tools to identify publications. Among these, the doi (Digital Object Identifier, a unique and formatted character string) has been in use since 2000 [5]. But currently, when writing a report, a thesis or an article with \\( \\LaTeX \\), a popular formatting language, an external tool is needed to gather bibliographic information by ourselves. This could be done automatically by directly using such unique identifiers.</p>\n<p>This statement is presented and explained in this short paper [1]. Basically, the idea is to refer to a publication with a direct, unique and global id, instead of giving a reference key linked to a dictionnary in a .bib file that might change from one project to another. This Bibtex file must either be constructed by hand or be exported from your favorite references manager. And this has to be carried out every time a new reference is added to your draft or your dissertation.</p>\n<p>Besides, I start to have an extended collection of articles in my Zotero... So when I export a folder to a bibtex file, there are several unused references so it can make it unnecessarily weighty. And more problematically, there also might be some omissions... that lead to errors while compiling the \\( \\LaTeX \\) project.</p>\n<p>This is a bit a shame as most of cited content in scientific litterature has an unique id that could serve directly as the reference key for Bibtex. This is what is proposed in the example from my github [3] where I adapted python codes from [1] and [2]. This goes along from a \\( \\LaTeX \\) demo (inspired from Overleaf documentation [4]). In order to run it, just execute the script in <code>Python_libs/Split.py</code> and it will generate a .bib reference file.</p>\n<p>The script browses all the .tex files contained in the directories and sub-directories of your \\( \\LaTeX \\) project. It detects the citation keys <code>\\cite{key}</code> in either DOI or arXiv id format. For each identifier, the information is retrieved and a .bib file is generated. A list of existing reference files .bib can be merged with the new file (in case there is no arXiv/doi id).</p>\n<p>As an exemple, if you use arXiv format <code>\\cite{2003.02751v2}</code> or a doi <code>\\cite{10.1016/j.jcp.2018.10.045}</code>, the following information will be added in the generated .bib file</p>\n<pre> @article{2003.02751v2, \n  Author = {Ehsan Haghighat and Maziar Raissi and Adrian Moure and Hector Gomez and Ruben Juanes}, \n  Title = {A deep learning framework for solution and discovery in solid mechanics},\n  ... }\n\n@article{10.1016/j.jcp.2018.10.045,\n  doi = {10.1016/j.jcp.2018.10.045}, \n  url = {https://doi.org/10.1016%2Fj.jcp.2018.10.045},\n  year = 2019, \n  month = {feb}, \n  ... }\n</pre>\n<p>The arXiv format detection and retrieving uses the library arxiv2bib [2].</p>\n<p>I adapted a code from [1] with some changes as :</p>\n<ul>\n<li>Format verification for doi format</li>\n<li>Replacing the usual reference key by the doi so that it matches the \\cite{doi} and nothing is to change in the \\( \\LaTeX \\) document</li>\n<li>Proper export to bib file and merging with an existing bibtex dictionnary</li>\n<li>Sub folder checking for .tex files research</li>\n<li>arXiv id support thanks to arxiv2bib module</li>\n<li>Adding some comments</li>\n</ul>\n<p>Then the idea might be to launch it during \\( \\LaTeX \\) compilation. This could be done with adding this piece of code in your main .tex file :</p>\n<pre>\\usepackage{python}\n\\begin{python}[Python_libs/Split.py]\n\\end{python}\n</pre>\n<p>Don't hesitate if you have ideas of improvements or questions. The code is publicly available at my github [3].</p>\n<p> </p>\n<p>[1] Simplifying the management of scientific reference and citation with a minimalist DOI-BibTex-LaTeX approach, Wei Li, <a href=\"dx.doi.org/10.15761/CMID.1000139\">dx.doi.org/10.15761/CMID.1000139</a></p>\n<p>[2] arxiv2bib repository package, <a href=\"https://pypi.org/project/arxiv2bib/\" rel=\"nofollow\">https://pypi.org/project/arxiv2bib/</a></p>\n<p>[3] My GitHub repository <a href=\"https://github.com/GRaynaud/doi-arxiv-to-bibtex-refs\">https://github.com/GRaynaud/doi-arxiv-to-bibtex-refs</a></p>\n<p>[4] Bibliography management with bibtex, Overleaf documentation <a href=\"https://www.overleaf.com/learn/latex/bibliography_management_with_bibtex\">https://www.overleaf.com/learn/latex/bibliography_management_with_bibtex</a></p>\n<p>[5] <a href=\"dx.doi.org/10.15761/CMID.1000139\">https://www.doi.org/factsheets/DOIKeyFacts.html</a></p>",
            "image": "https://GRaynaud.github.io/gh-pages/media/posts/9/IMG_20200719_151404550.jpg",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Science"
            ],
            "date_published": "2020-07-17T16:15:35-04:00",
            "date_modified": "2020-07-20T15:06:35-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/un-soupcon-de-cuisine/",
            "url": "https://GRaynaud.github.io/gh-pages/un-soupcon-de-cuisine/",
            "title": "Un soupçon de cuisine",
            "summary": "Il n’est rien de meilleur que la pâtisserie : D’abord pétrir la pâte en un berceau fécond, Y disposer des fruits, du sucre, du lait qu’on Enfourne une courte heure où joue la féerie. Oui, la voilà qui monte ! Et la voilà qui dore&hellip;",
            "content_html": "<p>Il n’est rien de meilleur que la pâtisserie :<br>D’abord pétrir la pâte en un berceau fécond,<br>Y disposer des fruits, du sucre, du lait qu’on<br>Enfourne une courte heure où joue la féerie.</p>\n<p>Oui, la voilà qui monte ! Et la voilà qui dore !<br>Ce festin qui s’annonce aux arômes friands :<br>La couronne scintille et les bords croustillants<br>M’enivrent tant, qu’assis au sol, je m’y endors.</p>\n<p>Le spectacle s’achève en délivrant l’étuve<br>Et l’appétit décroît sans qu’on n’ait rien goûté ;<br>Si bien qu’un petit four a le don d’envoûter<br>Comme une offrande auguste élevée par l’effluve.</p>\n<p>G.R. Montréal, 2020</p>\n<p> </p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-07-06T18:27:38-04:00",
            "date_modified": "2020-07-06T18:27:38-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/fredonnement/",
            "url": "https://GRaynaud.github.io/gh-pages/fredonnement/",
            "title": "Fredonnement",
            "summary": " Vaincre l’ennui : voilà l’audacieux programme ; Soupeser chaque son, ses consonnes rugueuses, Savourer le frisson de voyelles fougueuses ; La poésie nous offre à tous les vers un brame. Je la crois dévouée à tant d’inavouable, Attente délétère où l’on tente un accord,&hellip;",
            "content_html": "<p> </p>\n<p>Vaincre l’ennui : voilà l’audacieux programme ;<br>Soupeser chaque son, ses consonnes rugueuses,<br>Savourer le frisson de voyelles fougueuses ;<br>La poésie nous offre à tous les vers un brame.</p>\n<p>Je la crois dévouée à tant d’inavouable,<br>Attente délétère où l’on tente un accord,<br>Une cadence, un air inouï et accort<br>Qui clora l’envolée d’un soliste insatiable.</p>\n<p>Sur ma portée les mots peinent à accoucher.<br>Où a pu se cacher ma muse effarouchée ?<br>Je pars à sa recherche et ma plume griffonne.</p>\n<p>Emporté par sa voix dont les mélodies fusent,<br>Elle décrit le galbe en soupirant, confuse ;<br>L'aveu évaporé sous un sourire aphone.</p>\n<p> </p>\n<p>G.R. Montréal 2020</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-07-04T20:05:05-04:00",
            "date_modified": "2020-07-04T20:16:58-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/escalier-musical/",
            "url": "https://GRaynaud.github.io/gh-pages/escalier-musical/",
            "title": "Escalier musical",
            "summary": "Voici un court essai de vers rhopaliques proposés pour notre défi, toujours en temps limité. Dans sa version classique, la contrainte consiste à produire des vers dont le nombre de syllabes augmente puis diminue d'un en un. En guise d'exemple, Mon Mont Olympe qui fut&hellip;",
            "content_html": "<p>Voici un court essai de vers rhopaliques proposés pour notre défi, toujours en temps limité. Dans sa version classique, la contrainte consiste à produire des vers dont le nombre de syllabes augmente puis diminue d'un en un. En guise d'exemple, <a href=\"https://lashoun.com/writing/mon-mont-olympe/\" target=\"_blank\" rel=\"noopener noreferrer\">Mon Mont Olympe</a> qui fut une inspiration. Petite liberté : je me suis permis de dédoubler les vers afin d'insuffler davantage de rythme.</p>\n<p>Le <br>La <br>Frileux <br>Héla <br>L’inconnue <br>Qui marchait. <br>Ce son tenu <br>N’a point d’archet <br>Pour le faire vivre. <br>Il faut force souffle <br>Pour éveiller ce cuivre <br>Qu’on eût dit un baroufle !</p>\n<p>Sur les lèvres vermillon <br>Comme un papillon s’envole ; <br>Puis des pistons au pavillon <br>Surgit une note frivole.</p>\n<p>Sous chaque pas de la passagère <br>Erre la mélopée. Là, hissé, <br>File un nuage d’où une légère <br>Marche douce et leste s’est esquissée.</p>\n<p>Qu’il m’est heureux de balayer l’alalie <br>Quand viennent à nous les ennuis, les tempêtes ; <br>Voici mon remède à l’actuel hallali : <br>La prosodie trempée que chante une trompette.  </p>\n<p> </p>\n<p>G.R. Juin 2020 Montréal</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-07-03T12:49:14-04:00",
            "date_modified": "2020-07-03T12:49:14-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/rencontre-sur-les-cimes/",
            "url": "https://GRaynaud.github.io/gh-pages/rencontre-sur-les-cimes/",
            "title": "Rencontre sur les cimes",
            "summary": "Toujours pour le challenge des 30 jours, un triplet de quatrains en temps limité avec deux contraintes. Le thème : Everest et un mot à placer : \"hiémal\" (qui est relatif à l'hiver). Je me mis à rêver, gravissant l’Everest, D’un face à face étrange&hellip;",
            "content_html": "<p>Toujours pour le challenge des 30 jours, un triplet de quatrains en temps limité avec deux contraintes. Le thème : Everest et un mot à placer : \"hiémal\" (qui est relatif à l'hiver).</p>\n<hr>\n<p>Je me mis à rêver, gravissant l’Everest,<br>D’un face à face étrange avec un animal<br>Terrible. Je siégeais sur le zist et le zest<br>Comme pris d’un vertige infinitésimal.</p>\n<p>Ce fieffé fort et grand, sa griffe sans conteste<br>M’eût vite expédié dans l’espace abismal ;<br>Ou m’eût-il préféré un destin plus funeste<br>De finir embroché par ce monstre brumal.</p>\n<p>Je laisse l’anormal pour rallier le céleste.<br>Ce Yéti titanesque au gouffre fantomal<br>Y restera sans mal. Je m’en vais d’un pas preste<br>Miroiter les sillons du ciel hiémal.  </p>\n<p> </p>\n<p>G.R. Juin 2020, Montréal</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-06-25T09:29:03-04:00",
            "date_modified": "2020-06-25T09:29:03-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/des-flammes-dans-la-nuit/",
            "url": "https://GRaynaud.github.io/gh-pages/des-flammes-dans-la-nuit/",
            "title": "Des flammes dans la nuit",
            "summary": "Dans la série du défi des 30 jours de poésie avec Cyril et Antoine, voici quelques vers rédigés dans le temps d'une journée et dont le thème imposé est \"pompier\". Le bourg dans l’obscurité S’endort, insouciamment. Et lui, pendant sa nuitée Veille au moindre foudroiement.",
            "content_html": "<p>Dans la série du défi des 30 jours de poésie avec Cyril et Antoine, voici quelques vers rédigés dans le temps d'une journée et dont le thème imposé est \"pompier\".</p>\n<hr>\n<p>Le bourg dans l’obscurité<br>S’endort, insouciamment.<br>Et lui, pendant sa nuitée<br>Veille au moindre foudroiement.</p>\n<p>Caserné dans la cité<br>On le prive d’être amant ;<br>Car c’est avec probité<br>Qu’il bataille brillamment.</p>\n<p>Les flammèches délitées<br>Fulminent de filaments<br>Eclairant le ciel d’été.<br>Il faut partir prestement !</p>\n<p>Voilà sa réalité :<br>Vaincre le feu vaillamment.<br>Des héros nous ont quittés…<br>Embrassant le firmament.  </p>\n<p>G.R. Juin 2020, Montréal</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-06-24T20:17:21-04:00",
            "date_modified": "2020-06-24T21:11:05-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/evasion-insulaire/",
            "url": "https://GRaynaud.github.io/gh-pages/evasion-insulaire/",
            "title": "Évasion insulaire",
            "summary": "Dans la série du défi des 30 jours de poésie avec Cyril et Antoine, voici un essai dont le thème imposé est \"île déserte\" et rédigé dans le temps d'une journée. Le réveil, étourdi, de mes sens en alerte, Je tâte l’étendue de sable recouverte&hellip;",
            "content_html": "<p>Dans la série du défi des 30 jours de poésie avec Cyril et Antoine, voici un essai dont le thème imposé est \"île déserte\" et rédigé dans le temps d'une journée.</p>\n<hr>\n<p>Le réveil, étourdi, de mes sens en alerte,<br>Je tâte l’étendue de sable recouverte <br>Et l’odeur iodée flottant de l’onde verte…<br>Me voilà atterri sur une île déserte !</p>\n<p>Dois-je craindre une bête à l’appétit vorace ?<br>Dans quelle direction trouverais-je bien grâce ?<br>L’aplomb fatal de l’astre ardent déjà harasse…<br>Impossible, hélas, de s’enfuir à la brasse.</p>\n<p>Vite il me faut, avant que la folie ne guette,<br>M’arranger un abri de feuilles et haguettes<br>Et un socle seyant pour la scène qui choit :</p>\n<p>Mon orchestre étoilé lance sa symphonie :<br>Une valse avec la Voie Lactée, agonie<br>Qu’efface une vague en une ode à la joie.</p>\n<p> </p>\n<p>G.R. Juin 2020, Montréal</p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Literature (french)",
                   "30 Days Writing Challenge"
            ],
            "date_published": "2020-06-24T20:10:40-04:00",
            "date_modified": "2020-06-24T20:10:40-04:00"
        },
        {
            "id": "https://GRaynaud.github.io/gh-pages/dataset-code-availability-github/",
            "url": "https://GRaynaud.github.io/gh-pages/dataset-code-availability-github/",
            "title": "Dataset and code availability",
            "summary": "Open science is a key topic for today's research, as recent examples have depicted the difficulty of results reproductibility [1] in several scientific fields. More specifically, the long-term disponibility of experimental data is discussed in an interesting article [2] that leads to some proposals, for&hellip;",
            "content_html": "<p>Open science is a key topic for today's research, as recent examples have depicted the difficulty of results reproductibility [1] in several scientific fields.  More specifically, the long-term disponibility of experimental data is discussed in an interesting article [2] that leads to some proposals, for instance : </p>\n<ul>\n<li>A better identification of researchers, especially to be able to contact them even when the email address from the academic institution does not exist anymore</li>\n<li>Citable publications for dataset so that one does not need to carry out experiments or simuations that were already achieved. Also, it helps the acknowledgement of data generation work. It could also encourage to prepare, store and document data in a more structured and long-term strategy.</li>\n</ul>\n<p>As an example, I looked for a while for simulations data regarding a very basic configuration (2D laminar incompressible flow over a cylinder in a channel, a basic benchmark). I hoped to find geometry files, mesh and even, with a bit of confidence, results of computations with famous solvers (for instance Ansys, Abaqus, openFOAM...), from which I could start quickier my work. But in the end, I had very few success for this simple CFD case. This is annoying when one knows how much it can be time and power consuming to validate CFD results.</p>\n<p>Hence you will find on my github repository [3] some reports alongside numerical codes and data of my previous projects, when this is possible. When not specified otherwise, content is under licence GPL v3.0 [4] (among other things : free to use, modify and share, no warranty provided, attribution to authors).</p>\n<p> </p>\n<p>[1] Baker, Monya. \"Reproducibility crisis?.\" <i>Nature</i> 533.26 (2016): 353-66. <abbr title=\"Digital Object Identifier\">doi</abbr>:10.1038/533452a</p>\n<p>[2] Diehl, P., Tabiai, I., Baumann, F. W., Therriault, D., &amp; Levesque, M. (2018). Long term availability of raw experimental data in experimental fracture mechanics. <i>Engineering Fracture Mechanics</i>, <i>197</i>, 21-26. <a class=\"doi\" href=\"https://doi.org/10.1016/j.engfracmech.2018.04.030\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Persistent link using digital object identifier\" title=\"Persistent link using digital object identifier\">doi.org/10.1016/j.engfracmech.2018.04.030</a></p>\n<p>[3] <a href=\"https://github.com/GRaynaud\">https://github.com/GRaynaud</a></p>\n<p>[4] GNU GPL v3.0 <a href=\"https://www.gnu.org/licenses/gpl-3.0.en.html\">https://www.gnu.org/licenses/gpl-3.0.en.html</a></p>",
            "author": {
                "name": "G. Raynaud"
            },
            "tags": [
                   "Science"
            ],
            "date_published": "2020-06-10T20:32:25-04:00",
            "date_modified": "2020-06-10T21:58:44-04:00"
        }
    ]
}
